[

{
  "bookId": 1,
  "bookName": "Educated",
  "author": "Tara Westover",
  "image": "https://i.ibb.co/F04HzhP/Capture1.png",
  "review": ": Educated is an inspiring memoir of resilience and self-discovery. Tara Westover's journey from a survivalist family in rural Idaho to earning a PhD from Cambridge University is both captivating and thought-provoking. Her story of overcoming obstacles, seeking education, and finding her own path in life is truly inspiring. Westover's writing is honest, raw, and deeply moving, making this book a must-read for anyone seeking insight into the power of education and the human spirit.",
  "totalPages": 352,
  "rating": 4.7,
  "category": "Biography",
  "tags": ["Memoir", "Education"],
  "publisher": "Random House",
  "yearOfPublishing": 2018
},



{
  "bookId": 2,
  "bookName": "The Power of Habit",
  "author": "Charles Duhigg",
  "image": "https://i.ibb.co/QNyY9vb/817-Awc39-TZL-SL1500.jpg",
  "review": ": The Power of Habit is an insightful exploration of the science behind habits and how they can be changed. Charles Duhigg delves into the neurology, psychology, and sociology of habit formation, providing fascinating case studies and practical strategies for transforming habits. Whether you're looking to break a bad habit, build a new one, or understand the power of routines in our lives, this book offers valuable insights and actionable advice.",
  "totalPages": 371,
  "rating": 4.6,
  "category": "Self-Help",
  "tags": ["Psychology", "Productivity"],
  "publisher": "Random House",
  "yearOfPublishing": 2012
},


{
  "bookId": 3,
  "bookName": "Sapiens: A Brief History of Humankind",
  "author": "Yuval Noah Harari",
  "image": " https://i.ibb.co/xhrmqY0/91vuak6-U9c-L-SL1500.jpg",
  "review": " :Sapiens: A Brief History of Humankind takes readers on a thought-provoking journey through the history of Homo sapiens. Yuval Noah Harari provides a sweeping narrative that spans from the emergence of Homo sapiens in Africa to the present day, exploring key milestones in human evolution, culture, and society. Harari's writing is engaging, informative, and often provocative, challenging readers to reconsider their understanding of humanity's past, present, and future.",
  "totalPages": 443,
  "rating": 4.9,
  "category": "History",
  "tags": ["Anthropology", "Evolution"],
  "publisher": "Harper",
  "yearOfPublishing": 2011
},


{
  "bookId": 4,
  "bookName": "Pride and Prejudice",
  "author": "Jane Austen",
  "image": " https://i.ibb.co/Fwr9yLL/81-RPe-A1-EAf-L-SL1500.jpg",
  "review": ":  Pride and Prejudice is a timeless romance novel with sharp social commentary and memorable characters. Jane Austen's wit and insight shine through in this story of love, marriage, and societal expectations in 19th-century England. From the spirited Elizabeth Bennet to the enigmatic Mr. Darcy, the characters leap off the page, capturing readers' hearts and imaginations. Austen's keen observations of human nature and her mastery of the English language make this novel a classic that continues to resonate with readers today.",
  "totalPages": 279,
  "rating": 4.5,
  "category": "Classic",
  "tags": ["Romance", "Satire"],
  "publisher": "T. Egerton, Whitehall",
  "yearOfPublishing": 1813
}

,


{
  "bookId": 5,
  "bookName": "The Girl on the Train",
  "author": "Paula Hawkins",
  "image": "https://i.ibb.co/2qDjJZm/71-WAir-Fm5-SL-SL1316.jpg",
  "review": ":  The Girl on the Train is a gripping thriller with twists and turns that keep you on the edge of your seat. Paula Hawkins weaves a complex narrative of unreliable narrators, dark secrets, and unexpected revelations. As the story unfolds, the tension builds, drawing readers deeper into the mystery of what happened to the missing woman at the center of the plot. Hawkins' skillful storytelling and deft characterizations make this novel a riveting read from start to finish.",
  "totalPages": 336,
  "rating": 4.2,
  "category": "Mystery",
  "tags": ["Suspense", "Domestic Thriller"],
  "publisher": "Riverhead Books",
  "yearOfPublishing": 2015
},


{
  "bookId": 6,
  "bookName": "To Kill a Mockingbird",
  "author": "Harper Lee",
  "image": "https://i.ibb.co/2qDjJZm/71-WAir-Fm5-SL-SL1316.jpg",
  "review": ":  To Kill a Mockingbird is a gripping thriller with twists and turns that keep you on the edge of your seat. Paula Hawkins weaves a complex narrative of unreliable narrators, dark secrets, and unexpected revelations. As the story unfolds, the tension builds, drawing readers deeper into the mystery of what happened to the missing woman at the center of the plot. Hawkins' skillful storytelling and deft characterizations make this novel a riveting read from start to finish.",
  "totalPages": 281,
  "rating": 4.6,
  "category": "Classic",
  "tags": ["Social Justice", "Coming of Age"],
  "publisher": "J. B. Lippincott & Co.",
  "yearOfPublishing": 1960
}


]